<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use App\Models\City;
use App\Models\CityMenu;
use App\Models\MenuRelation;
use Illuminate\Support\Facades\DB;

class CityMenuController extends Controller
{
    /*
        Собираем большой массив всех городов
    */
    private array $cityList = [
        'Moscow' => 
            [
            'token' => 'DsPGRWHt5G7ckpL84Uy3P5xsCESYzG4E',    
            'phone' => "+7 (495) 215-09-94",
            'address' => "117638, Москва, Болотниковская д 18к 2",
            'region' => "Москва",
            'prefix' => null
            ],
        'Chel' =>	
            [
            'token' => '0Gioe1y9NGYAAI5Z1YzUzx22W3WJMxHP',
            'phone' => "+7 (351) 700-95-02",
            'address' => "454008, Челябинск, Комсомольский проспект д. 9а",
            'region' => "Челябинск",
	        'prefix' => "CHEL"
            ],
        'Ekb' => 
            [
                'token' => 'mrsn4MgVeVF2w5TZQk2UdbEO7urSjnoH',
                'phone' => "+7 (343) 210-10-90",
                'address' => "620078, Екатеринбург, Библиотечная д. 62а, бокс 1",
                'region' => "Екатеринбург",
                'prefix' => null
            ],
        'Kazan' =>
            [
                'token' => 'JupQ7uwQAt69U9C7WBowammSM9GIVozv',        
                'phone' => "+7(843) 210-38-10",
                'address' => "420110, Республика Татарстан, Казань, проспект Победы, 87",
                'region' => "Казань",
                'prefix' => "KAZAN"
            ],
        'Kostroma' =>
            [
                'token' => '631zigSjq4dTUf2suVmlM6d205sSdkBS',
                'phone' => "+7 (962) 187-15-72",
                'address' => "г.Кострома, ул. Юрия Смирнова 36",
                'region' => "Кострома",
                'prefix' => "KOSTROMA"
            ],
        'NN' =>
            [
                'token' => 'Ff36QFhiQmjm6UikFAhz16zeJEquQfWL',
                'phone' => "+7 (904) 056-49-11",
                'address' => "603037, ул. Кузьмина д 1а",
                'region' => "Нижний Новгород",
                'prefix' => "NN"
            ],
        'Novokuz' =>
            [
                'token' => 'tNxDJUAcBwdt58hoPMP0o5ftUIJGnx2D',                       
                'phone' => "+7(996)381-08-02",
                'address' => "654005, Новокузнецк, проспект Строителей, 18",
                'region' => "Новокузнецк",
                'prefix' => "NOVOKUZ"
            ],
        'Novosib' =>
            [
                'token' => 'tNxDJUAcBwdt59hoPMP0o5ftUIJGnx2D',
                'phone' => "+7 (903) 939-52-75",
                'address' => "630033, Новосибирск, Оловозаводская улица, 47/8",
                'region' => "Новосибирск",
                'prefix' => "NOVOSIB"
            ],
        'Omsk' => 
            [
                'token' => '2DItYJRYXCgyoE1j0H00qqlFHoJi7u0m',
                'phone' => "+7 (953) 857-92-13",
                'address' => "644074, Омск, ул. Дмитриева 20к3",
                'region' => "Омск",
                'prefix' => "OMSK"
            ],
        'Rostov' =>
            [
                'token' => 'XT8hj36y88Im37vMpcyxNJ4BcaOEnRsl',
                'phone' => "+7(909) 401-62-66",
                'address' => "344079, Ростов-на-Дону, Зоологическая улица, 51Б",
                'region' => "Ростов-на-Дону",
                'prefix' => "ROSTOV",
            ],
        'Samara' =>
            [
                'token' => 'YGiQReXJ17hM3rTtZBgIGDdMm83PaZd1',        
                'phone' => "+7 (846) 211-35-14",
                'address' => "443082, Самара, Новоурицкая улица, 10А",
                'region' => "Самара",
                'prefix' => "SAMARA"
            ],
        'Saratov' => 
            [
                'token' => 'lOC3oG3vMjfFCyZxk5MdKPZWCFYcA66A',       
                'phone' => "+7(967) 800-27-92",
                'address' => "410505, Саратов, ул. Танкистов 90а",
                'region' => "Саратов",
                'prefix' => "SARATOV"
            ],
        'Spb' =>
            [
                'token' => 'V78783U8IgfEUMwUKIoSmbVEBXMbmuD5',            
                'phone' => "+7 (921) 888-14-86",
                'address' => "196105, г. Санкт-Петербург, ул. Кузнецовская, д. 31",
                'region' => "Санкт-Петербург",
                'prefix' => "SPB",
            ],
        'TMN' =>
            [
                'token' => 'lFDpm61IbJSkl5HbLGOvX9npOVULzbKa',
                'phone' => "+7 (345) 257-81-84 ",
                'address' => "625034, ул.Дамбовская 45",
                'region' => "Тюмень",
                'prefix' => "TMN"
            
            ],
        'Ufa' =>
            [
               'token' => '3wG7lgZubBGJCdkdd7WdiNbFxVYfcdEJ',
               'phone' => "+7(347) 200-90-92",
               'address' => "450027, Республика Башкортостан, Уфа, Индустриальное шоссе, 7/1",
               'region' => "Уфа",
               'prefix' => "UFA",
            ],
        'Voroneg' =>
            [
                'token' => 'LDYt73H3i99l44kzlTRj62NF1nU848P3',
                'phone' => "+7 (961) 109-09-20",
                'address' => "115597, Воронеж, ул. Тамбовская  д. 119",
                'region' => "Воронеж",
                'prefix' => "VORONEG"
            ],
        'Yar' =>
            [
                'token' => 'R91otzXnnl0mrb5Q3z4EMOooeOmROIE2',
                'phone' => "+7 (905) 135-53-05",
                'address' => "г.Ярославль, Полушкина Роща 23",
                'region' => "Ярославль",
                'prefix' => "YAR"       
            ],
        'Yl' => 
            [
                'token' => '5cxRByPgPteUJBk5h5B4fnO2o6gpFN2X',
                'phone' => "+7 (8422) 50-55-72",
                'address' => "432045, Ульяновск, ул. Московское шоссе д 34",
                'region' => "Ульяновск",
                'prefix' => "Yl",
            ]
    ];

    /*
        Собираем большой массив всех menuID
    */
    public array $menuIDs = [
        'Moscow' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829', "delivery" => "ПВЗ"],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829', "delivery" => "ПВЗ"],
                32 =>   ['name' => "Подшипники ступицы", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                63 =>   ['name' => "Компрессоры кондиционера", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                65 =>   ['name' => "Осушители кондиционера", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                66 =>   ['name' => "Радиаторы кондиционера", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                615 =>   ['name' => "Испарители", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                51 =>   ['name' => "Бензонасосы", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                252 =>  ['name' => "ТНВД и ТННД", 'typeId' => '11-627', 'delivery' => "Свой партнер Деловые Линии"],
                155 =>  ['name' => "Форсунки", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                221 =>   ['name' => "Датчик уровня топлива", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                9 =>  ['name' => "Насосы", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                400 =>  ['name' => "Компоненты форсунок", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                370 =>  ['name' => "Топливная рампа", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                135 =>  ['name' => "Компоненты рамп", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                401 =>  ['name' => "Компоненты ТНВД", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                581 =>  ['name' => "Система DNOX", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                547 =>  ['name' => "Актуаторы", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                153 =>   ['name' => "Картриджи", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                61 =>  ['name' => "Катушки зажигания", 'typeId' => '16-831', "delivery" => "ПВЗ"],
                98 =>  ['name' => "Коммутаторы", 'typeId' => '16-831', "delivery" => "ПВЗ"],
                379 =>  ['name' => "Свеча накала", 'typeId' => '16-831', "delivery" => "ПВЗ"],
                55 =>  ['name' => "Аккумуляторы", 'typeId' => '11-619', "delivery" => "ПВЗ"],
                41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624', 'delivery' => "Свой партнер Деловые Линии"],
                297 =>  ['name' => "Шток рулевой рейки", 'typeId' => '11-624', "delivery" => "ПВЗ"],
        
                265 =>  ['name' => "Рулевой редуктор гидравлический", 'typeId' => '11-624', 'delivery' => "Свой партнер Деловые Линии"],
                225 =>  ['name' => "Редукторы TRUCK", 'typeId' => '11-624', 'delivery' => "Свой партнер Деловые Линии"],
                113 =>  ['name' => "Редукторы ГУР", 'typeId' => '11-624', 'delivery' => "Свой партнер Деловые Линии"],
        
                266 =>  ['name' => "Колонки рулевые", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                70 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                71 =>   ['name' => "Вентилятор отопителя", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                545 =>  ['name' => "Насос гидравлический", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                
                
                542 =>  ['name' => "Ремкомплект для насосов гидравлические", 'typeId' => '33-542', "delivery" => "ПВЗ"],
                887 =>  ['name' => "Гидроцилиндры", 'typeId' => '33-887', "delivery" => "ПВЗ"],
                896 =>  ['name' => "Гидроцилиндры", 'typeId' => '33-896', "delivery" => "ПВЗ"],
                891 =>  ['name' => "Гидроцилиндры", 'typeId' => '33-891', "delivery" => "ПВЗ"],
                972 =>  ['name' => "Гидроцилиндры", 'typeId' => '33-972', "delivery" => "ПВЗ"],
        
        
                516 =>  ['name' => "Сцепление", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                518 =>  ['name' => "Ведомый диск", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                519 =>  ['name' => "Нажимной диск", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                517 =>  ['name' => "Маховик сцепления", 'typeId' => '16-833', "delivery" => "ПВЗ"],
                305 =>  ['name' => "Шланги системы ГУР", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                563 =>  ['name' => "Ремкомплекты ремня ГРМ", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                // 599 =>  ['name' => "Элементы кузова", 'typeId' => '16-841'],
                560 =>  ['name' => "Ролики обводные ГРМ", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                34 =>  ['name' => "Натяжители Ремня ГРМ", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                549 =>  ['name' => "Колодки тормозные", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                389 =>  ['name' => "Диски тормозные", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                489 =>  ['name' => "Пневмобаллоны", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                490 =>  ['name' => "Компрессоры", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                487 =>  ['name' => "Пневмоподвеска", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                629 =>  ['name' => "Ступичные подшипники", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                307 =>  ['name' => "Карданы рулевые", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                396 =>   ['name' => "Бачок ГУР/ЭГУР", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                617 =>   ['name' => "Радиаторы отопителя", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                424 =>   ['name' => "Резисторы печки", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                420 =>   ['name' => "АБС", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                150 =>   ['name' => "Давления в шине датчик", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                409 =>   ['name' => "Давления воздуха ДВС", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                812 =>   ['name' => "Давления масла датчики", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                410 =>   ['name' => "Лямда-зонды", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                417 =>   ['name' => "Датчики парковки", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                774 =>   ['name' => "Положения дроссельной заслонки датчики", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                798 =>   ['name' => "Положения кузова датчики", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                366 =>   ['name' => "Расхода воздуха ДВС", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                636 =>   ['name' => "Детали двигателя", 'typeId' => '16-836', "delivery" => "ПВЗ"],
                808 =>   ['name' => "Валы коленчатые", 'typeId' => '16-833', "delivery" => "ПВЗ"],
                810 =>   ['name' => "Валы распределительные", 'typeId' => '16-833', "delivery" => "ПВЗ"],
                405 =>   ['name' => "Дроссельные заслонки", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                660 =>   ['name' => "Коллекторы впускные", 'typeId' => '16-834', "delivery" => "ПВЗ"],
                863 =>   ['name' => "Крышки клапанные", 'typeId' => '16-832', "delivery" => "ПВЗ"],
                614 =>   ['name' => "Крышки маслозаливной горловины", 'typeId' => '16-836', "delivery" => "ПВЗ"],
                776 =>   ['name' => "Насосы масляные", 'typeId' => '16-836', "delivery" => "ПВЗ"],
                736 =>   ['name' => "Патрубки", 'typeId' => '16-837', "delivery" => "ПВЗ"],
                773 =>   ['name' => "Поддоны двигателя", 'typeId' => '16-836', "delivery" => "ПВЗ"],
                128 =>   ['name' => "Шкивы коленвала ", 'typeId' => '16-833', "delivery" => "ПВЗ"],
                129 =>   ['name' => "Клапаны холостого хода ДВС", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                605 =>   ['name' => "Амортизаторы багажника", 'typeId' => '16-818', "delivery" => "ПВЗ"],
                820 =>   ['name' => "Амортизаторы капота", 'typeId' => '16-814', "delivery" => "ПВЗ"],
                811 =>   ['name' => "Замки дверей", 'typeId' => '16-810', "delivery" => "ПВЗ"],
                133 =>   ['name' => "Переключатели подрулевые", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                647 =>   ['name' => "Стеклоподъемники", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                627 =>   ['name' => "Амортизаторы", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                784 =>   ['name' => "Подрамники", 'typeId' => '16-835', "delivery" => "ПВЗ"],
                966 =>   ['name' => "Трубки кондиционера", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                126 =>   ['name' => "Ремни", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                104 =>   ['name' => "Ремни поликлиновые ", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                127 =>   ['name' => "Ремни ГРМ", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                103 =>   ['name' => "Ремни клиновые ", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                557 =>   ['name' => "Ролики приводных ремней", 'typeId' => '16-839', "delivery" => "ПВЗ"],
                705 =>   ['name' => "Натяжители приводного ремня", 'typeId' => '16-839', "delivery" => "ПВЗ"],
                562 =>   ['name' => "Ролики натяжителя ", 'typeId' => '16-839', "delivery" => "ПВЗ"],
                561 =>   ['name' => "Ролики обводные", 'typeId' => '16-839', "delivery" => "ПВЗ"],
                569 =>   ['name' => "Шестерни коленвала", 'typeId' => '16-833', "delivery" => "ПВЗ"],
                566 =>   ['name' => "Шестерни распредвала", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                572 =>   ['name' => "Шкивы коленвала", 'typeId' => '16-833', "delivery" => "ПВЗ"],
                576 =>   ['name' => "Клапан фаз", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                419 =>   ['name' => "Провода высоковольтные", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                479 =>   ['name' => "Бачки расширительные", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                495 =>   ['name' => "Вентиляторы охлаждения", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                491 =>   ['name' => "Вискомуфты", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                655 =>   ['name' => "Интеркулеры", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                498 =>   ['name' => "Крышка расширительного бачка", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                608 =>   ['name' => "Моторы вентилятора", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                583 =>   ['name' => "Насосы водяные", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                478 =>   ['name' => "Патрубки, трубки", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                663 =>   ['name' => "Радиаторы масляные", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                616 =>   ['name' => "Радиаторы системы охлаждения", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                642 =>   ['name' => "Термостаты", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                500 =>   ['name' => "Бачки стеклоомывателя", 'typeId' => '11-626', "delivery" => "ПВЗ"],
                606 =>   ['name' => "Трапеции стеклоочистителя", 'typeId' => '11-626', "delivery" => "ПВЗ"],
                657 =>   ['name' => "Главные тормозные цилиндры", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                648 =>   ['name' => "Суппорты тормозные", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                895 =>   ['name' => "Электроусилители тормозов", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                790 =>   ['name' => "Моторы включения полного привода", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                907 =>   ['name' => "Моторы включения заднего моста", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                741 =>   ['name' => "Трансмиссия", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                520 =>   ['name' => "Подшипники выжимные", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                623 =>   ['name' => "Цилиндры главные", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                624 =>   ['name' => "Цилиндры рабочие", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                801 =>   ['name' => "Карданные валы", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                765 =>   ['name' => "Поддоны КПП", 'typeId' => '16-827', "delivery" => "ПВЗ"],
                534 =>   ['name' => "Фильтры", 'typeId' => '16-836', "delivery" => "ПВЗ"],
                537 =>   ['name' => "Воздушные фильтры", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                942 =>   ['name' => "Корпус масляного фильтра", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                501 =>   ['name' => "Патрубок воздушный", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                329 =>   ['name' => "Датчики рулевое", 'typeId' => '11-624', "delivery" => "ПВЗ"],
            ],
        'Chel' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                71 =>   ['name' => "Вентилятор отопителя", 'typeId' => '11-630'],
                103 =>  ['name' => "Ремни клиновые", 'typeId' => '16-841'],
                104 =>  ['name' => "Ремни ручейковые", 'typeId' => '16-841'],
                41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624'],
                70 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624'],
                // 01112023
                498 =>   ['name' => "Крышки расширетельного бачка", 'typeId' => '16-521'],
                340 =>   ['name' => "Датчики давления масла", 'typeId' => '11-624'],
                642 =>   ['name' => "Термостаты", 'typeId' => '16-521'],
                419 =>   ['name' => "Провода высковольтные", 'typeId' => '16-831'],
                566 =>   ['name' => "Нестерни распредвала", 'typeId' => '16-841'],
                155 =>   ['name' => "Форсунки ", 'typeId' => '11-627'],
            ],
        'Ekb' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                32 =>   ['name' => "Подшипники ступицы", 'typeId' => '11-623', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                63 =>   ['name' => "Компрессоры кондиционера", 'typeId' => '16-842', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                65 =>   ['name' => "Осушители кондиционера", 'typeId' => '16-842', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                66 =>   ['name' => "Радиаторы кондиционера", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                615 =>   ['name' => "Испарители", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                51 =>   ['name' => "Бензонасосы", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                252 =>  ['name' => "ТНВД и ТННД", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                155 =>  ['name' => "Форсунки", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                221 =>   ['name' => "Датчик уровня топлива", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                9 =>  ['name' => "Насосы", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                400 =>  ['name' => "Компоненты форсунок", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                370 =>  ['name' => "Топливная рампа", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                135 =>  ['name' => "Компоненты рамп", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                401 =>  ['name' => "Компоненты ТНВД", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                581 =>  ['name' => "Система DNOX", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                547 =>  ['name' => "Актуаторы", 'typeId' => '16-842', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                153 =>   ['name' => "Картриджи", 'typeId' => '16-842', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                61 =>  ['name' => "Катушки зажигания", 'typeId' => '16-831', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                98 =>  ['name' => "Коммутаторы", 'typeId' => '16-831', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                379 =>  ['name' => "Свеча накала", 'typeId' => '16-831', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                55 =>  ['name' => "Аккумуляторы", 'typeId' => '11-619', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                297 =>  ['name' => "Шток рулевой рейки", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
        
                265 =>  ['name' => "Рулевой редуктор гидравлический", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                225 =>  ['name' => "Редукторы TRUCK", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                113 =>  ['name' => "Редукторы ГУР", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
        
                266 =>  ['name' => "Колонки рулевые", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                70 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                71 =>   ['name' => "Вентилятор отопителя", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                545 =>  ['name' => "Насос гидравлический", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                516 =>  ['name' => "Сцепление", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                518 =>  ['name' => "Ведомый диск", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                519 =>  ['name' => "Нажимной диск", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                517 =>  ['name' => "Маховик сцепления", 'typeId' => '16-833', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                305 =>  ['name' => "Шланги системы ГУР", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                563 =>  ['name' => "Ремкомплекты ремня ГРМ", 'typeId' => '16-841', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                // 599 =>  ['name' => "Элементы кузова", 'typeId' => '16-841'],
                560 =>  ['name' => "Ролики обводные ГРМ", 'typeId' => '16-841', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                34 =>  ['name' => "Натяжители Ремня ГРМ", 'typeId' => '16-841', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                549 =>  ['name' => "Колодки тормозные", 'typeId' => '11-628', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                389 =>  ['name' => "Диски тормозные", 'typeId' => '11-628', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                489 =>  ['name' => "Пневмобаллоны", 'typeId' => '11-623', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                490 =>  ['name' => "Компрессоры", 'typeId' => '11-623', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                487 =>  ['name' => "Пневмоподвеска", 'typeId' => '11-623', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                629 =>  ['name' => "Ступичные подшипники", 'typeId' => '11-623', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
        
        
                307 =>  ['name' => "Карданы рулевые", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                396 =>   ['name' => "Бачок ГУР/ЭГУР", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                617 =>   ['name' => "Радиаторы отопителя", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                424 =>   ['name' => "Резисторы печки", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                420 =>   ['name' => "АБС", 'typeId' => '11-628', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                150 =>   ['name' => "Давления в шине датчик", 'typeId' => '11-628', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                409 =>   ['name' => "Давления воздуха ДВС", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                812 =>   ['name' => "Давления масла датчики", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                410 =>   ['name' => "Лямда-зонды", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                417 =>   ['name' => "Датчики парковки", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                774 =>   ['name' => "Положения дроссельной заслонки датчики", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                798 =>   ['name' => "Положения кузова датчики", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                366 =>   ['name' => "Расхода воздуха ДВС", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                636 =>   ['name' => "Детали двигателя", 'typeId' => '16-836', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                808 =>   ['name' => "Валы коленчатые", 'typeId' => '16-833', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                810 =>   ['name' => "Валы распределительные", 'typeId' => '16-833', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                405 =>   ['name' => "Дроссельные заслонки", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                660 =>   ['name' => "Коллекторы впускные", 'typeId' => '16-834', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                863 =>   ['name' => "Крышки клапанные", 'typeId' => '16-832', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                614 =>   ['name' => "Крышки маслозаливной горловины", 'typeId' => '16-836', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                776 =>   ['name' => "Насосы масляные", 'typeId' => '16-836', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                736 =>   ['name' => "Патрубки", 'typeId' => '16-837', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                773 =>   ['name' => "Поддоны двигателя", 'typeId' => '16-836', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                128 =>   ['name' => "Шкивы коленвала ", 'typeId' => '16-833', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                129 =>   ['name' => "Клапаны холостого хода ДВС", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                605 =>   ['name' => "Амортизаторы багажника", 'typeId' => '16-818', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                820 =>   ['name' => "Амортизаторы капота", 'typeId' => '16-814', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                811 =>   ['name' => "Замки дверей", 'typeId' => '16-810', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                133 =>   ['name' => "Переключатели подрулевые", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                647 =>   ['name' => "Стеклоподъемники", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                627 =>   ['name' => "Амортизаторы", 'typeId' => '11-623', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                784 =>   ['name' => "Подрамники", 'typeId' => '16-835', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                966 =>   ['name' => "Трубки кондиционера", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                126 =>   ['name' => "Ремни", 'typeId' => '16-841', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                104 =>   ['name' => "Ремни поликлиновые ", 'typeId' => '16-841', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                127 =>   ['name' => "Ремни ГРМ", 'typeId' => '16-841', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                103 =>   ['name' => "Ремни клиновые ", 'typeId' => '16-841', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                557 =>   ['name' => "Ролики приводных ремней", 'typeId' => '16-839', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                705 =>   ['name' => "Натяжители приводного ремня", 'typeId' => '16-839', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                562 =>   ['name' => "Ролики натяжителя ", 'typeId' => '16-839', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                561 =>   ['name' => "Ролики обводные", 'typeId' => '16-839', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                569 =>   ['name' => "Шестерни коленвала", 'typeId' => '16-833', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                566 =>   ['name' => "Шестерни распредвала", 'typeId' => '16-841', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                572 =>   ['name' => "Шкивы коленвала", 'typeId' => '16-833', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                576 =>   ['name' => "Клапан фаз", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                419 =>   ['name' => "Провода высоковольтные", 'typeId' => '11-630', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                479 =>   ['name' => "Бачки расширительные", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                495 =>   ['name' => "Вентиляторы охлаждения", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                491 =>   ['name' => "Вискомуфты", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                655 =>   ['name' => "Интеркулеры", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                498 =>   ['name' => "Крышка расширительного бачка", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                608 =>   ['name' => "Моторы вентилятора", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                583 =>   ['name' => "Насосы водяные", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                478 =>   ['name' => "Патрубки, трубки", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                663 =>   ['name' => "Радиаторы масляные", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                616 =>   ['name' => "Радиаторы системы охлаждения", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                642 =>   ['name' => "Термостаты", 'typeId' => '16-521', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                500 =>   ['name' => "Бачки стеклоомывателя", 'typeId' => '11-626', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                606 =>   ['name' => "Трапеции стеклоочистителя", 'typeId' => '11-626', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                657 =>   ['name' => "Главные тормозные цилиндры", 'typeId' => '11-628', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                648 =>   ['name' => "Суппорты тормозные", 'typeId' => '11-628', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                895 =>   ['name' => "Электроусилители тормозов", 'typeId' => '11-628', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                790 =>   ['name' => "Моторы включения полного привода", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                907 =>   ['name' => "Моторы включения заднего моста", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                741 =>   ['name' => "Трансмиссия", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                516 =>   ['name' => "Сцепление", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                518 =>   ['name' => "Диск ведомый", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                519 =>   ['name' => "Диск нажимной", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                520 =>   ['name' => "Подшипники выжимные", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                623 =>   ['name' => "Цилиндры главные", 'typeId' => '11-628', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                624 =>   ['name' => "Цилиндры рабочие", 'typeId' => '11-628', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                801 =>   ['name' => "Карданные валы", 'typeId' => '11-629', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                765 =>   ['name' => "Поддоны КПП", 'typeId' => '16-827', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                534 =>   ['name' => "Фильтры", 'typeId' => '16-836', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                537 =>   ['name' => "Воздушные фильтры", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                942 =>   ['name' => "Корпус масляного фильтра", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                501 =>   ['name' => "Патрубок воздушный", 'typeId' => '11-627', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                329 =>   ['name' => "Датчики рулевое", 'typeId' => '11-624', 'agreements' => ['80c03ca82a221bf711e5d5682ae5409a']],
                14 =>    ['name' => "Диодные мосты генератора", 'typeId' => '16-829', 'agreements' => ['8db8005056b0ba9711eefba47c2c2ba1']],
                15 =>    ['name' => "Регуляторы генератора", 'typeId' => '16-829', 'agreements' => ['8db8005056b0ba9711eefba47c2c2ba1']],
                13 =>    ['name' => "Роторы генератора", 'typeId' => '16-829', 'agreements' => ['8db8005056b0ba9711eefba47c2c2ba1']],
                27 =>    ['name' => "Статоры генератора", 'typeId' => '16-829', 'agreements' => ['8db8005056b0ba9711eefba47c2c2ba1']],
                35 =>    ['name' => "Шкивы обгонные генератора", 'typeId' => '16-829', 'agreements' => ['8db8005056b0ba9711eefba47c2c2ba1']],
                11 =>    ['name' => "Бендиксы", 'typeId' => '16-829', 'agreements' => ['8db8005056b0ba9711eefba47c2c2ba1']],
                21 =>    ['name' => "Втягивающие реле стартера", 'typeId' => '16-829', 'agreements' => ['8db8005056b0ba9711eefba47c2c2ba1']],
                10 =>    ['name' => "Роторы стартера", 'typeId' => '16-829', 'agreements' => ['8db8005056b0ba9711eefba47c2c2ba1']],
                80 =>    ['name' => "Статоры стартера", 'typeId' => '16-829', 'agreements' => ['8db8005056b0ba9711eefba47c2c2ba1']],
            ],
        'Kazan' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
            ],
        'Kostroma' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                547 =>  ['name' => "Актуаторы", 'typeId' => '16-842'],
                153 =>   ['name' => "Картриджи", 'typeId' => '16-842'],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842'],
                490 =>  ['name' => "Компрессоры", 'typeId' => '11-623'],
            ],
        'NN' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829']
            ],
        'Novokuz' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                63 =>   ['name' => "Компрессоры кондиционера", 'typeId' => '16-842'],
                51 =>   ['name' => "Бензонасосы", 'typeId' => '11-627'],
                221 =>   ['name' => "Датчик уровня топлива", 'typeId' => '11-627'],
                9 =>  ['name' => "Насосы", 'typeId' => '11-627'],
                153 =>   ['name' => "Картриджи", 'typeId' => '16-842'],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842'],
                61 =>  ['name' => "Катушки зажигания", 'typeId' => '16-831'],
                41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624'],
                70 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624']
            ],
        'Novosib' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                63 =>   ['name' => "Компрессоры кондиционера", 'typeId' => '16-842'],
                51 =>   ['name' => "Бензонасосы", 'typeId' => '11-627'],
                221 =>   ['name' => "Датчик уровня топлива", 'typeId' => '11-627'],
                9 =>  ['name' => "Насосы", 'typeId' => '11-627'],
                153 =>   ['name' => "Картриджи", 'typeId' => '16-842'],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842'],
                61 =>  ['name' => "Катушки зажигания", 'typeId' => '16-831'],
                41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624'],
                70 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624']
            ],
        'Omsk' => 
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829', "delivery" => "ПВЗ"],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829', "delivery" => "ПВЗ"],
                32 =>   ['name' => "Подшипники ступицы", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                63 =>   ['name' => "Компрессоры кондиционера", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                65 =>   ['name' => "Осушители кондиционера", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                66 =>   ['name' => "Радиаторы кондиционера", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                615 =>   ['name' => "Испарители", 'typeId' => '16-521', "delivery" => "ПВЗ"],
                51 =>   ['name' => "Бензонасосы", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                252 =>  ['name' => "ТНВД и ТННД", 'typeId' => '11-627', 'delivery' => "Свой партнер Деловые Линии"],
                155 =>  ['name' => "Форсунки", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                221 =>   ['name' => "Датчик уровня топлива", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                9 =>  ['name' => "Насосы", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                400 =>  ['name' => "Компоненты форсунок", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                370 =>  ['name' => "Топливная рампа", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                135 =>  ['name' => "Компоненты рамп", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                401 =>  ['name' => "Компоненты ТНВД", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                581 =>  ['name' => "Система DNOX", 'typeId' => '11-627', "delivery" => "ПВЗ"],
                547 =>  ['name' => "Актуаторы", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                153 =>   ['name' => "Картриджи", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842', "delivery" => "ПВЗ"],
                61 =>  ['name' => "Катушки зажигания", 'typeId' => '16-831', "delivery" => "ПВЗ"],
                98 =>  ['name' => "Коммутаторы", 'typeId' => '16-831', "delivery" => "ПВЗ"],
                379 =>  ['name' => "Свеча накала", 'typeId' => '16-831', "delivery" => "ПВЗ"],
                55 =>  ['name' => "Аккумуляторы", 'typeId' => '11-619', "delivery" => "ПВЗ"],
                41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624', 'delivery' => "Свой партнер Деловые Линии"],
                297 =>  ['name' => "Шток рулевой рейки", 'typeId' => '11-624', "delivery" => "ПВЗ"],
        
                265 =>  ['name' => "Рулевой редуктор гидравлический", 'typeId' => '11-624', 'delivery' => "Свой партнер Деловые Линии"],
                225 =>  ['name' => "Редукторы TRUCK", 'typeId' => '11-624', 'delivery' => "Свой партнер Деловые Линии"],
                113 =>  ['name' => "Редукторы ГУР", 'typeId' => '11-624', 'delivery' => "Свой партнер Деловые Линии"],
        
                266 =>  ['name' => "Колонки рулевые", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                70 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                71 =>   ['name' => "Вентилятор отопителя", 'typeId' => '11-630', "delivery" => "ПВЗ"],
                545 =>  ['name' => "Насос гидравлический", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                516 =>  ['name' => "Сцепление", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                518 =>  ['name' => "Ведомый диск", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                519 =>  ['name' => "Нажимной диск", 'typeId' => '11-629', "delivery" => "ПВЗ"],
                517 =>  ['name' => "Маховик сцепления", 'typeId' => '16-833', "delivery" => "ПВЗ"],
                305 =>  ['name' => "Шланги системы ГУР", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                563 =>  ['name' => "Ремкомплекты ремня ГРМ", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                // 599 =>  ['name' => "Элементы кузова", 'typeId' => '16-841'],
                560 =>  ['name' => "Ролики обводные ГРМ", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                34 =>  ['name' => "Натяжители Ремня ГРМ", 'typeId' => '16-841', "delivery" => "ПВЗ"],
                549 =>  ['name' => "Колодки тормозные", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                389 =>  ['name' => "Диски тормозные", 'typeId' => '11-628', "delivery" => "ПВЗ"],
                887 =>  ['name' => "Гидроцилиндры", 'typeId' => '11-624', "delivery" => "ПВЗ"],
                489 =>  ['name' => "Пневмобаллоны", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                490 =>  ['name' => "Компрессоры", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                487 =>  ['name' => "Пневмоподвеска", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                629 =>  ['name' => "Ступичные подшипники", 'typeId' => '11-623', "delivery" => "ПВЗ"],
                15 =>    ['name' => "Регуляторы генератора", 'typeId' => '16-829'],
                35 =>    ['name' => "Шкивы обгонные генератора", 'typeId' => '16-829'],
            ],
        'Rostov' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
            ],
        'Samara' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                63 =>   ['name' => "Компрессоры кондиционера", 'typeId' => '16-842'],
                547 =>  ['name' => "Актуаторы", 'typeId' => '16-842'],
                153 =>   ['name' => "Картриджи", 'typeId' => '16-842'],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842'],
                71 =>   ['name' => "Вентилятор отопителя", 'typeId' => '11-630']
            ],
        'Saratov' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829']
            ],
        'Spb' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                63 =>   ['name' => "Компрессоры кондиционера", 'typeId' => '16-842'],
                65 =>   ['name' => "Осушители кондиционера", 'typeId' => '16-842'],
                66 =>   ['name' => "Радиаторы кондиционера", 'typeId' => '16-521'],
                615 =>   ['name' => "Испарители", 'typeId' => '16-521'],
                51 =>   ['name' => "Бензонасосы", 'typeId' => '11-627'],
                252 =>  ['name' => "ТНВД и ТННД", 'typeId' => '11-627'],
                155 =>  ['name' => "Форсунки", 'typeId' => '11-627'],
                221 =>   ['name' => "Датчик уровня топлива", 'typeId' => '11-627'],
                9 =>  ['name' => "Насосы", 'typeId' => '11-627'],
                547 =>  ['name' => "Актуаторы", 'typeId' => '16-842'],
                153 =>   ['name' => "Картриджи", 'typeId' => '16-842'],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842'],
                61 =>  ['name' => "Катушки зажигания", 'typeId' => '16-831'],
                98 =>  ['name' => "Коммутаторы", 'typeId' => '16-831'],
                41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624'],
                113 =>  ['name' => "Редукторы ГУР", 'typeId' => '11-624'],
                70 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624'],
                71 =>   ['name' => "Вентилятор отопителя", 'typeId' => '11-630'],
                545 =>  ['name' => "Насос гидравлический", 'typeId' => '11-624'],
                516 =>  ['name' => "Сцепление", 'typeId' => '11-62900'],
                518 =>  ['name' => "Ведомый диск", 'typeId' => '11-62900'],
                519 =>  ['name' => "Нажимной диск", 'typeId' => '11-62900'],
                560 =>  ['name' => "Ролики обводные ГРМ", 'typeId' => '16-841'],
                34 =>  ['name' => "Натяжители Ремня ГРМ", 'typeId' => '16-841'],
                489 =>  ['name' => "Пневмобаллоны", 'typeId' => '11-623'],
                490 =>  ['name' => "Компрессоры", 'typeId' => '11-623'],
            ],
        'TMN' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                103 =>  ['name' => "Ремни клиновые", 'typeId' => '16-841'],
                104 =>  ['name' => "Ремни ручейковые", 'typeId' => '16-841'],
        
        
                359 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624'],
                41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624'],
                252 =>  ['name' => "ТНВД и ТННД", 'typeId' => '11-627'],
                51 =>   ['name' => "Бензонасосы", 'typeId' => '11-627'],
                63 =>   ['name' => "Компрессоры кондиционера", 'typeId' => '16-842'],
                32 =>   ['name' => "Подшипники ступицы", 'typeId' => '11-623'],
                71 =>   ['name' => "Вентилятор отопителя", 'typeId' => '11-630'],
        
        
                396 =>   ['name' => "Бачок ГУР/ЭГУР", 'typeId' => '11-624'],
                479 =>   ['name' => "Бачки расширительные", 'typeId' => '16-521'],
            ],
        'Ufa' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                // 71 =>   ['name' => "Вентилятор отопителя", 'typeId' => '11-630'],
                // 103 =>  ['name' => "Ремни клиновые", 'typeId' => '16-841'],
                // 104 =>  ['name' => "Ремни ручейковые", 'typeId' => '16-841'],
                // 41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624'],
                // 70 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624'],
                // // 01112023
                // 498 =>   ['name' => "Крышки расширетельного бачка", 'typeId' => '16-521'],
                // 340 =>   ['name' => "Датчики давления масла", 'typeId' => '11-624'],
                // 642 =>   ['name' => "Термостаты", 'typeId' => '16-521'],
                // 419 =>   ['name' => "Провода высковольтные", 'typeId' => '16-831'],
                // 566 =>   ['name' => "Нестерни распредвала", 'typeId' => '16-841'],
                // 155 =>   ['name' => "Форсунки ", 'typeId' => '16-627'],
            ],
        'Voroneg' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829']
            ],
        'Yar' => 
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                547 =>  ['name' => "Актуаторы", 'typeId' => '16-842'],
                153 =>   ['name' => "Картриджи", 'typeId' => '16-842'],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842'],
                490 =>  ['name' => "Компрессоры", 'typeId' => '11-623'],
            ],
        'Yl' =>
            [
                8 =>    ['name' => "Генераторы", 'typeId' => '16-829'],
                7 =>    ['name' => "Стартеры", 'typeId' => '16-829'],
                41 =>   ['name' => "Рулевые рейки", 'typeId' => '11-624'],
                70 =>   ['name' => "Насосы ГУР и ЭГУР", 'typeId' => '11-624'],
                39 =>   ['name' => "Турбокомпрессоры", 'typeId' => '16-842']
            ]    
    ];

    private array $typeIdMap = [
        "16-829" => "6-406100",
        "11-627" => "11-62700",
        "16-831" => "16-83100",
        "11-624" => "11-62400",
        "16-842" => "16-84200",
        "11-629" => "11-62900",
        "11-630" => "11-63000",
        "16-841" => "16-84100",
        "16-521" => "16-52100",
    ];


    public $groupAvito = [
        "6-401" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для мототехники',
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "6-411" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для водного транспорта',
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "6-406" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-618" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Автосвет',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-619" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Аккумуляторы',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-623" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Подвеска',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-624" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Рулевое управление',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-625" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Салон',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-626" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Стекла',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-627" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Топливная и выхлопная системы',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-628" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Тормозная система',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-629" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Трансмиссия и привод',
            'TransmissionSparePartType' => 'Сцепление',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-62900" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => 'Трансмиссия',
            'TransmissionSparePartType' => 'Сцепление',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-630" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Электрооборудование',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-63000" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => 'Двигатели и комплектующие',
            'TechnicSparePartType' => 'Система кондиционирования и отопления',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-521" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => 'Система охлаждения',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-52100" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатели и комплектующие',
            'TechnicSparePartType' => 'Система кондиционирования и отопления',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "19-2855" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Автомобиль на запчасти',
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-805" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Балки, лонжероны',
            'DeviceType' => null,
        ],
        "16-806" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Бамперы',
            'DeviceType' => null,
        ],
        "16-807" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Брызговики',
            'DeviceType' => null,
        ],
        "16-808" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Двери',
            'DeviceType' => null,
        ],
        "16-809" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Заглушки',
            'DeviceType' => null,
        ],
        "16-810" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Замки',
            'DeviceType' => null,
        ],
        "16-811" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Защита',
            'DeviceType' => null,
        ],
        "16-812" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Зеркала',
            'DeviceType' => null,
        ],
        "16-813" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Кабина',
            'DeviceType' => null,
        ],
        "16-814" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Капот',
            'DeviceType' => null,
        ],
        "16-815" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Крепления',
            'DeviceType' => null,
        ],
        "16-816" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Крылья',
            'DeviceType' => null,
        ],
        "16-817" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Крыша',
            'DeviceType' => null,
        ],
        "16-818" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Крышка, дверь багажника',
            'DeviceType' => null,
        ],
        "16-819" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Кузов по частям',
            'DeviceType' => null,
        ],
        "16-820" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Кузов целиком',
            'DeviceType' => null,
        ],
        "16-821" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Лючок бензобака',
            'DeviceType' => null,
        ],
        "16-822" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Молдинги, накладки',
            'DeviceType' => null,
        ],
        "16-823" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Пороги',
            'DeviceType' => null,
        ],
        "16-824" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Рама',
            'DeviceType' => null,
        ],
        "16-825" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Решетка радиатора',
            'DeviceType' => null,
        ],
        "16-826" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Кузов',
            'EngineSparePartType' => null,
            'BodySparePartType' => 'Стойка кузова',
            'DeviceType' => null,
        ],
        "16-827" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Блок цилиндров, головка, картер',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-828" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Вакуумная система',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-829" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Генераторы, стартеры',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-830" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Двигатель в сборе',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-831" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Катушка зажигания, свечи, электрика',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-832" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Клапанная крышка',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-833" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Коленвал, маховик',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-834" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Коллекторы',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-835" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Крепление двигателя',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-836" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Масляный насос, система смазки',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-837" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Патрубки вентиляции',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-838" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Поршни, шатуны, кольца',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-839" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Приводные ремни, натяжители',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-840" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Прокладки и ремкомплекты',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-841" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Ремни, цепи, элементы ГРМ',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-84100" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => 'Двигатели и комплектующие',
            'TechnicSparePartType' => 'ГРМ',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-842" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Турбины, компрессоры',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-84200" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => 'Двигатели и комплектующие',
            'EngineSparePartType' => 'Турбины, компрессоры',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-843" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Электродвигатели и компоненты',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-844" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Двигатель',
            'EngineSparePartType' => 'Впускная система',
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "10-044" => [
            'GoodsType' => 'Шины, диски и колёса',
            'ProductType' => 'Колпаки',
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "10-045" => [
            'GoodsType' => 'Шины, диски и колёса',
            'ProductType' => 'Колёса',
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "10-046" => [
            'GoodsType' => 'Шины, диски и колёса',
            'ProductType' => 'Диски',
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "10-047" => [
            'GoodsType' => 'Шины, диски и колёса',
            'ProductType' => 'Мотошины',
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "10-048" => [
            'GoodsType' => 'Шины, диски и колёса',
            'ProductType' => 'Легковые шины',
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "28-49575" => [
            'GoodsType' => 'Шины, диски и колёса',
            'ProductType' => 'Шины для грузовиков и спецтехники',
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "4-942" => [
            'GoodsType' => 'Масла и автохимия',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "4-943" => [
            'GoodsType' => 'Аксессуары',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "4-963" => [
            'GoodsType' => 'Инструменты',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "4-964" => [
            'GoodsType' => 'Багажники и фаркопы',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "4-965" => [
            'GoodsType' => 'Прицепы',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "6-416" => [
            'GoodsType' => 'Экипировка',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "20" => [
            'GoodsType' => 'Аудио- и видеотехника',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "21" => [
            'GoodsType' => 'GPS-навигаторы',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "22" => [
            'GoodsType' => 'Тюнинг',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-631" => [
            'GoodsType' => 'Противоугонные устройства',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => 'Автосигнализации',
        ],
        "11-632" => [
            'GoodsType' => 'Противоугонные устройства',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => 'Иммобилайзеры',
        ],
        "11-633" => [
            'GoodsType' => 'Противоугонные устройства',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => 'Механические блокираторы',
        ],
        "11-634" => [
            'GoodsType' => 'Противоугонные устройства',
            'ProductType' => null,
            'SparePartType' => null,
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => 'Спутниковые системы',
        ],

        "33-545" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидромоторы и гидронасосы",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-542" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидромоторы и гидронасосы",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-54200" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидромоторы и гидронасосы",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-887" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидроцилиндры и баки",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-88700" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидроцилиндры и баки",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-896" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидроцилиндры и баки",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-89600" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидроцилиндры и баки",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-891" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидрораспределители",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-89100" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидрораспределители",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-972" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидромоторы и гидронасосы",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "33-97200" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => "Для грузовиков и спецтехники",
            'SparePartType' => "Гидравлические и пневмосистемы",
            'TechnicSparePartType' => "Гидромоторы и гидронасосы",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],

        "6-406100" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => "Двигатели и комплектующие",
            'TechnicSparePartType' => "Стартеры и генераторы",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],

        "11-62700" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => "Двигатели и комплектующие",
            'TechnicSparePartType' => "Топливная система",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "16-83100" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => "Двигатели и комплектующие",
            'TechnicSparePartType' => "Система зажигания",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-62300" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для автомобилей',
            'SparePartType' => 'Подвеска и рулевое управление',
            'TechnicSparePartType' => "Амортизаторы и пружины",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
        "11-62400" => [
            'GoodsType' => 'Запчасти',
            'ProductType' => 'Для грузовиков и спецтехники',
            'SparePartType' => "Подвеска и рулевое управление",
            'TechnicSparePartType' => "Рулевые рейки и усилители",
            'EngineSparePartType' => null,
            'BodySparePartType' => null,
            'DeviceType' => null,
        ],
    ];

    /**
     * Метод добавления записей для города через массивы
     * @param $token
     * @param $address
     * @param $region
     * @param $phone
     * @return bool
     */
    public function addToDatabase()
    {
        DB::beginTransaction();

        try {
            //Создаём записи городов
            foreach($this->cityList as $key => $value) {
                $cityModel = new City();
                $cityModel->region = $value['region'];
                $cityModel->token = $value['token'];
                $cityModel->phone = $value['phone'];
                $cityModel->address = $value['address'];
                $cityModel->prefix = $value['prefix'];
                $cityModel->save();
    
                $cityId = $cityModel->id;
                //Создаём отношения между городами и id меню
                foreach ($this->menuIDs[$key] as $k => $v) {
                    $cityMenuModel = new CityMenu();
                    $cityMenuModel->city_id = $cityId;
                    $cityMenuModel->menuId = $k;
                    $cityMenuModel->name = $v['name'];
                    $cityMenuModel->save();
                }
            }

            //Получаем данные id сайта и свойств продукта без повторов
            $mergedArray = [];

            foreach ($this->menuIDs as $items) {
                foreach ($items as $id => $item) {
                    if (!isset($mergedArray[$id])) {
                        $mergedArray[$id] = $item;
                    }
                }
            }

            //Формируем массив для заполнения таблицы menu_relations
            $array = [];

            //Получаем данные по спецтехнике если у этого menuId есть раздел спецтехники
            foreach ($mergedArray as $k => $v) {
                $array[$k]['items'][] = $this->groupAvito[$v['typeId']];
                if(array_key_exists($v['typeId'], $this->typeIdMap)) {
                    $array[$k]['items'][] = $this->groupAvito[$this->typeIdMap[$v['typeId']]];
                }
            }

            //Заполняем таблицу отношений url и товара
            foreach ($array as $item => $items) {
                foreach ($items['items'] as $k => $val){
                    $relationModel = new MenuRelation();
                    foreach ($val as $i => $value){
                        $relationModel->menuId = $item;
                        $relationModel->setAttribute($i, $value);
                    }
                        $relationModel->save();
                }
            }
        DB::commit();
        return true;
        } catch (\Exception $e) {
            DB::rollback();
            return false;
        }
    }
}
